app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date ASC
---
  def index
    if params[:ratings] == nil and params[:sort_by] == nil
      flash.keep
      redirect_to_movies_path if session[:ratings] != nil and session[:sort_by] != nil
      redirect_to_movies_path(session[:ratings], nil) if session[:ratings] != nil and
        session[:sort_by] == nil
      redirect_to_movies_path(@all_ratings) if session[:ratings] == nil and session[:sort_by] != nil
      redirect_to_movies_path(@all_ratings, nil) if session[:ratings] == nil and
        session[:sort_by] == nil
    elsif params[:ratings] == nil
      redirect_to_movies_path(session[:ratings], params[:sort_by]) if session[:ratings] != nil
      redirect_to_movies_path(@all_ratings, params[:sort_by])
    elsif params[:sort_by] == nil
      redirect_to_movies_path(params[:ratings]) if session[:sort_by] != nil
    end

    @all_ratings = Movie.get_distinct_ratings.sort!
    @ratings = params[:ratings] if params[:ratings].is_a? Array
    @ratings = params[:ratings].keys if params[:ratings].is_a? Hash
    @ratings = @all_ratings if @ratings == nil or @ratings.empty?